# Задача 14: Требуется вывести все целые степени двойки (т.е. числа вида 2k), не превосходящие числа N.

n = int(input('Введите число: '))
m = 0
c = 2
for i in range(n):
    if m != 1:
        c = c ** i
        if c <= n:
            print(c, end=' ')
            c = 2
        else:
            m = 1
    else:
        i = n